DCL (COMPLEX, REAL, IMAG, CONJG, ABS, SQRT, EXP, LOG, SIN, COS, TAN) BUILTIN;
DCL Z COMPLEX FLOAT;
DCL W COMPLEX FLOAT;
DCL MAG FLOAT;

Z = COMPLEX(3, 4);
W = Z * CONJG(Z) + COMPLEX(0, 2);
MAG = ABS(Z);
CALL DISPLAY(REAL(W));
CALL DISPLAY(IMAG(W));
CALL DISPLAY(MAG);
CALL DISPLAY(IMAG(SQRT(COMPLEX(-1, 0))));
