DCL POINTER BUILTIN;
DCL BASEPTR POINTER;
DCL NEXTPTR POINTER;

CALL POINTER();
CALL POINTER(4096);
CALL POINTER(4096, 16);
CALL POINTER(BASEPTR, 32);
CALL POINTER(NEXTPTR);
