DCL EVENTS FILE RECORD UPDATE ENVIRONMENT(VSAM(ESDS), PATH('events.esds')) BINARY;
DCL RBA FIXED BIN(31);
DCL RECORD CHARACTER;

OPEN FILE(EVENTS);
WRITE FILE(EVENTS) FROM(RECORD);
READ FILE(EVENTS) RBA(RBA) INTO(RECORD);
CLOSE FILE(EVENTS);
