DCL CUSTOMER FILE RECORD UPDATE ENVIRONMENT(VSAM(KSDS), KEYOFFSET(0), KEYLENGTH(4), PATH('customer.ksds')) BINARY;
DCL KEY CHARACTER;
DCL RECORD CHARACTER;

OPEN FILE(CUSTOMER);
WRITE FILE(CUSTOMER) FROM(RECORD);
READ FILE(CUSTOMER) KEY(KEY) INTO(RECORD);
CLOSE FILE(CUSTOMER);
