DCL LINEAR FILE RECORD UPDATE ENVIRONMENT(VSAM(LDS), PATH('linear.lds')) BINARY;
DCL RBA FIXED BIN(31);
DCL LEN FIXED BIN(31);
DCL PAYLOAD CHARACTER;

OPEN FILE(LINEAR);
WRITE FILE(LINEAR) RBA(RBA) FROM(PAYLOAD);
READ FILE(LINEAR) RBA(RBA) LENGTH(LEN) INTO(PAYLOAD);
CLOSE FILE(LINEAR);
