DCL SLOTS FILE RECORD UPDATE ENVIRONMENT(VSAM(RRDS), RECORDLENGTH(6), PATH('slots.rrds')) BINARY;
DCL RRN FIXED BIN(31);
DCL RECORD CHARACTER;

OPEN FILE(SLOTS);
WRITE FILE(SLOTS) RRN(RRN) FROM(RECORD);
READ FILE(SLOTS) RRN(RRN) INTO(RECORD);
CLOSE FILE(SLOTS);
