SUBSTR: PROC(S, START, COUNT) RETURNS(CHARACTER) RECURSIVE;
  DCL S CHARACTER VARYING;
  DCL START FIXED BIN(31);
  DCL COUNT FIXED BIN(31);
  RETURN S;
END SUBSTR;

