DCL RESULT FIXED BIN(31);
DCL A FLOAT;
DCL B FIXED DECIMAL(10,2);
DCL FLAG BIT;

RESULT = 2 + 3 * 4 ** 2;
FLAG = ^FLAG | RESULT > 10 & A + B >= 0;
CALL DISPLAY(RESULT);
