ADDPAIR: PROC(LEFT, RIGHT);
  LEFT = LEFT + RIGHT;
END ADDPAIR;

DCL LEFT FIXED BIN(31), RIGHT FIXED BIN(31);
LEFT = 40;
RIGHT = 2;
CALL ADDPAIR(RIGHT, LEFT) BY NAME;

