INCREMENT: PROC(VALUE);
  VALUE = VALUE + 1;
END INCREMENT;

DCL TOTAL FIXED BIN(31);
TOTAL = 41;
CALL INCREMENT(TOTAL) BY REFERENCE;
CALL DISPLAY(TOTAL);

