PFIXED: PROC(V) RETURNS(FIXED);
  RETURN V;
END PFIXED;

PCHAR: PROC(V) RETURNS(CHARACTER);
  RETURN V;
END PCHAR;

DCL SELECTOR GENERIC(PFIXED WHEN(FIXED), PCHAR WHEN(CHARACTER));

