DCL TOTAL FIXED BIN(31);

TOTAL = 0;
GOTO SKIP_INITIAL_ASSIGNMENT;
TOTAL = 99;

SKIP_INITIAL_ASSIGNMENT:
    TOTAL = TOTAL + 1;

GO TO FINISHED;
TOTAL = 100;

FINISHED:
    CALL DISPLAY('GOTO COMPLETE');
