DCL A FIXED BIN(31);
DCL B FIXED BIN(31);
DCL C FIXED BIN(31);
DCL D FIXED BIN(31);
DCL E FIXED BIN(31);
DCL F FIXED BIN(31);
DCL G FIXED BIN(31);
DCL H FIXED BIN(31);
DCL RESULT FIXED BIN(31);

RESULT = A OR B AND C = D || E + F * G ** H;
CALL DISPLAY(RESULT);
