%DECLARE FEATURE FIXED;
%ACTIVATE FEATURE;
%REPLACE LIMIT BY 4;
%IF FEATURE %THEN %NOTE 'FEATURE ACTIVE';
%DO I = 1 TO LIMIT;
%NOTE 'PREPROCESSOR LOOP BODY';
%END;
%INCLUDE 'COMMON.PLI';
%XINCLUDE 'GENERATED.PLI';
%INSCAN MEMBER_NAME;
%XINSCAN MEMBER_NAME;
%PRINT;
%NOPRINT;
%PAGE;
%SKIP 2;
%PUSH PRINT;
%POP PRINT;
%GOTO PP_DONE;
%LEAVE LOOP1;
%ITERATE LOOP1;
%PROCEDURE MAC(ARG) RETURNS(CHAR);
%RETURN ARG;
%END MAC;

PP_DONE:
    CALL DISPLAY('PREPROCESSOR COMMANDS PARSE');
