%DECLARE FEATURE FIXED;
%FEATURE = 1;
%REPLACE RESULT BY PREPROCESSED_RESULT;
%IF FEATURE %THEN;
DCL RESULT FIXED BIN(31);
RESULT = 42;
%ELSE;
DCL RESULT FIXED BIN(31);
RESULT = 0;
%END;
CALL DISPLAY(RESULT);
