FACT: PROC(N) RECURSIVE RETURNS(FIXED BIN(31));
  IF N = 0 THEN RETURN 1;
  CALL FACT(N);
  RETURN N;
END FACT;

DCL N FIXED BIN(31);
N = 3;
CALL FACT(N);

