DCL 1 CUSTOMER,
      2 ID FIXED BIN(31),
      2 NAME CHAR(20),
      2 ADDRESS,
        3 ZIP FIXED BIN(31);

CUSTOMER.ID = 1001;
CUSTOMER.ADDRESS.ZIP = 55123;
CALL DISPLAY(CUSTOMER.ID);
