DCL TOTAL FIXED BIN(31);

TOTAL = 0;

DO WHILE TOTAL < 2;
  TOTAL = TOTAL + 1;
END;

DO;
  TOTAL = TOTAL + 1;
UNTIL TOTAL = 4;
END;

IF TOTAL ~= 0 THEN DO;
  CALL DISPLAY('TOTAL IS NOT ZERO');
END;
ELSE DO;
  CALL DISPLAY('TOTAL IS ZERO');
END;

SELECT;
  WHEN(TOTAL => 4) CALL DISPLAY('TOTAL REACHED FOUR');
  OTHERWISE CALL DISPLAY('TOTAL BELOW FOUR');
END;
