DCL POINTER BUILTIN;
DCL P POINTER;
DCL 1 REC BASED(P),
      2 ID FIXED BIN(31),
      2 ADDRESS,
        3 ZIP FIXED BIN(31);

P = POINTER(100);
P->REC.ID = 1001;
P->REC.ADDRESS.ZIP = P->REC.ID + 1;
REC.ID = 2002;
CALL DISPLAY(P->REC.ADDRESS.ZIP);
