DCL POINTER BUILTIN;
DCL LEFTP POINTER;
DCL RIGHTP POINTER;
DCL 1 NODE BASED(LEFTP),
      2 ID FIXED BIN(31),
      2 NEXT POINTER,
      2 PAYLOAD,
        3 COUNT FIXED BIN(31);

LEFTP = POINTER(200);
RIGHTP = POINTER(300);
LEFTP->NODE.ID = 1;
LEFTP->NODE.PAYLOAD.COUNT = 10;
RIGHTP->NODE.ID = 2;
RIGHTP->NODE.PAYLOAD.COUNT = LEFTP->NODE.PAYLOAD.COUNT + 5;
CALL DISPLAY(LEFTP->NODE.ID);
CALL DISPLAY(RIGHTP->NODE.PAYLOAD.COUNT);
