DCL POINTER BUILTIN;
DCL P POINTER;
DCL 1 REC BASED(P),
      2 ID FIXED BIN(31),
      2 VALUE FIXED BIN(31);

P = POINTER(512);
REC.ID = 77;
REC.VALUE = REC.ID + 23;
CALL DISPLAY(REC.VALUE);
