DCL BIN FILE STREAM UPDATE ENVIRONMENT(PATH('payload.bin')) BINARY;
DCL BUF CHARACTER;
DCL PART CHARACTER;
DCL POS FIXED BIN(31);

BUF = 'PAYLOAD';

OPEN FILE(BIN);
WRITE FILE(BIN) FROM(BUF);
LOCATE FILE(BIN) SET(POS);
READ FILE(BIN) SIZE(3) OFFSET(2) INTO(PART);
CLOSE FILE(BIN);
