DCL F FILE RECORD UPDATE ENVIRONMENT(RECFM(V), PATH('records.dat')) BINARY;
DCL BUF CHARACTER;

OPEN FILE(F);
READ FILE(F) INTO(BUF);
WRITE FILE(F) FROM(BUF);
CLOSE FILE(F);
