DCL RECFILE FILE RECORD UPDATE ENVIRONMENT(RECFM(F), LRECL(8), PATH('records-fixed.dat')) TEXT;
DCL REC CHARACTER;
DCL POS FIXED BIN(31);

REC = 'OLDREC';

OPEN FILE(RECFILE);
WRITE FILE(RECFILE) FROM(REC);
LOCATE FILE(RECFILE) SET(POS);
READ FILE(RECFILE) INTO(REC);
REC = 'NEWREC';
REWRITE FILE(RECFILE) POSITION(0) FROM(REC);
CLOSE FILE(RECFILE);

OPEN FILE(RECFILE);
DELETE FILE(RECFILE);
