DCL CLIENT SOCKET;
DCL PAYLOAD CHARACTER VARYING;

PAYLOAD = 'PING FROM PRIMITIVE SENDER';

CALL TCPIP_OPEN(CLIENT);
CALL TCPIP_SEND(CLIENT, PAYLOAD);
CALL TCPIP_CLOSE(CLIENT);
