DCL CLIENT_SOCKET SOCKET;
DCL SERVER_SOCKET SOCKET;
DCL PAYLOAD CHARACTER VARYING;
DCL RESPONSE CHARACTER VARYING;

PAYLOAD = 'PING THROUGH SOCKET STREAM';

CALL SOCKET_OPEN(CLIENT_SOCKET);
CALL SOCKET_WRITE(CLIENT_SOCKET, PAYLOAD);
CALL SOCKET_READ(SERVER_SOCKET, RESPONSE);
CALL SOCKET_CLOSE(CLIENT_SOCKET);
CALL SOCKET_CLOSE(SERVER_SOCKET);
